<!-- * 10.0 Иногда нужно запускать какой-то код с какими-то интервалами и здесь у VueUse есть утилита, которая работает с интервалами. -->
<script setup>
import { useInterval } from '@vueuse/core'
import { watch } from 'vue'

// 10.1 Можно очень быстро создать счётчик с помощью этой утилиты, который будет прибавлять по единице каждую секунду.
// 10.2 Если аргументом в функцию передать какое-то число, то можно изменить скорость счёта, например 500, и тогда интервал отсчёта изменится до 0.5 секунд.
// 10.3 Если нам нужно как-то управлять счётчиком, то мы можем вторым аргументом передать объект с настройками и также деструктурировать сущности "counter", "resume" & "pause."
const { counter, resume, pause, isActive } = useInterval(500, { controls: true })

// 10.6 Также, мы конечно можем и вызывать какую-то функцию с определённым интервалом, скажем вызывать в консоль "Hello world!" каждые 3 секунды, с помощью "watch", где первым аргументом у нас будет счётчик, а вторым коллбэк-функция, которую хотим запускать.
watch(counter, () => console.log('Hello world!'))
</script>

<template>
  <div class="ml-20 mb-2 text-4xl">{{ counter }}</div>
  <!-- 10.4 Создадим кнопку-переключатель, которая будет ставить на паузу счётчик и запускать его вновь. -->
  <button @click="isActive ? pause() : resume()" class="min-w-28 text-center mr-2">
    {{ isActive ? 'Pause' : 'Resume' }}
  </button>
  <!-- 10.5 Ну, а сбросить счётчик легко присвоив ему значение 0. -->
  <button @click="counter = 0">Reset</button>
</template>
