<script setup>
// import { ref, watch } from 'vue'
import { useMagicKeys, whenever } from '@vueuse/core'

// * 5.0 "useMagicKeys" для этой функции мы можем деструктурировать любую клавишу, какую нам нужно. Например деструктурируем "a", "b" и "c".
// const { a, b, c } = useMagicKeys()

// 5.3 Также мы можем следить за комбинацией клавиш, если нам нужно, чтобы только по нажатии нескольких одновременно что-то происходило. Для этого нам надо записать клавиши из комбинации через _.
// ? 5.4 Также можно использовать переменную "current", чтобы показать какие клавиши уже были нажаты.
const { z_x_c, current } = useMagicKeys()

// 5.1 Теперь мы можем наблюдать за этими клавишами, когда они были нажаты или отпущены. И тогда, когда мы нажмём "a" на клавиатуре, то сработает коллбэк и в консоль получим true, но когда отпустим, то получим false.
// watch(a, (pressed) => console.log(pressed))
// 5.2 Однако, если нам нужно, чтобы коллбэк срабатывал только тогда, когда pressed в значении "true", то мы можем использовать функцию "whenever"
whenever(z_x_c, () => console.log('Wow, you just pressed the combo!'))
</script>

<template>
  <div>{{ current }}</div>
</template>
