<!-- * 7.0 "usePageLeave": индикация, что курсор мыши ушёл со страницы (его viewport) и выдаёт булево значение. Это может пригодится, чтобы привлечь внимание пользователя, если он собирается покинуть страницу и тут будет уместно использовать в связке "whenever". -->
<script setup>
import { usePageLeave, whenever } from '@vueuse/core'

const isLeft = usePageLeave()

// 7.1 Но если делать это каждый раз снова и снова, то этом может сильно раздражать. Что если у нас задача показать алёрт лишь в первый раз? Для этого поместим функцию "whenever" в переменную "unwatch". И т.к. "whenever" это всего лишь обёртка функции "watch", то мы поместим вызова "unwatch" сразу после вызова алёрт и т.о. он будет вызываться лишь 1 раз, после чего алёрт уже не будет вызываться до обновления страницы или захода на неё вновь.
const unwatch = whenever(isLeft, () => {
  alert('Leaving already? 😕')
  unwatch()
})
</script>

<template>
  <div class="mb-5 text-2xl font-medium">
    {{ isLeft }}
  </div>
</template>
