<!-- * 14.0 "useTransition": с помощью этой утилиты мы можем легко переходить от одного числового значения к другому. -->
<script setup>
import { ref } from 'vue'
import { TransitionPresets, useTransition } from '@vueuse/core'

// 14.1 Сперва создадим реф-переменную "percent" в исходном значении 0.
const percent = ref(0)

// 14.8.1 ... и эта опция должна ссылаться на реф "disabled" с булевым значением. И теперь, если мы поменяем значение этого рефа на true во время анимации, то анимация остановится и значение сразу же перескочит на конечно. Чтобы это продемонстрировать сделаем ещё одну кнопку "Disable" в шаблоне. ↓
const disabled = ref(false)

// 14.9.1 Для начала создадим ещё один реф, чтобы хранить в нём цвет прогресс-бара.
const color = ref('bg-blue-700')

// 14.4 Теперь по клику на кнопку значение прыгает с 0 до 100, но представим, что у нас задача сделать анимация, чтобы это происходило не рывком, а перебирая все цифры между 0 и 100. Это делается элементарно с "useTransition":
// 14.7 А чтобы смотрелось ещё красивее мы можем добавить пресеты вторым аргументом, а также изменить длительность анимации.
// 14.8.0 Также, чтобы заблокировать анимацию можно добавить опцию "disabled"...
// 14.9.0 А ещё можно добавлять функции "onStarted" & "onFinished", чтобы запускать какой-то код в начале и в конце анимации. Давайте продемонстрируем это покрасив прогресс-бар в зелёный цвет, когда он достигнет 100%. ↑
const animatedPercent = useTransition(percent, {
  transition: TransitionPresets.easeInOutCubic,
  duration: 3000,
  disabled,
  onStarted() {},
  onFinished() {
    color.value = 'bg-green-700'
  },
})

// 14.2 Затем создадим функцию load, где мы назначим переменной "percent" значение 100.
const load = () => {
  percent.value = 100
}
</script>

<!-- 14.3 А в шаблоне мы будем отображать значение "percent" и ещё добавим кнопку, запускающую функцию "load". -->
<!-- 14.5 Ну, а чтобы убрать дробные числа для красоты добавим ещё метод объекта Math 'floor'. -->
<!-- * 14.6 Выглядит супер! Но ещё больше пользы useTransition может принести, когда мы применим его к CSS-стилям, использующим цифры. Это позволит нам создавать элементы, которые плавно меняют свой размер, цвет, позицию на экране и т.д. Итак сделаем таким образом шкалу красивую загрузки. Для этого мы сперва создадим div с классом "loading" и застилизуем его. А ширина у нас будет стилем динамическим и поместим мы в неё всё то же значение animatedPercent рефа. -->
<!-- 14.9.2 А теперь добавим прогресс-бару динамический класс, чтобы менять его цвет. -->
<template>
  <div class="min-w-196">
    <div class="h-2.5 rounded-4xl" :class="color" :style="`width: ${animatedPercent}%`"></div>
    <div class="mb-10 pt-5 text-3xl text-center">{{ Math.floor(animatedPercent) }}</div>
    <button @click="load" class="cursor-pointer mt-3 block mx-auto">Load</button>
    <button @click="disabled = true" class="cursor-pointer mt-3 block mx-auto">Disable</button>
  </div>
</template>
